// Плохой стиль
// Какие недостатки вы видите в стиле написания кода этого примера?

// function pow(x,n) // нет пробела между x и n и {} находится на новой строке
// {
//   let result=1; // нет пробелов
//   for(let i=0;i<n;i++) {result*=x;} // нет пробелов и код в {} находится на той же строке
//   return result;
// }

// let x=prompt("x?",''), n=prompt("n?",'') // нет пробелов и опять вся логика на одной строке
// if (n<=0)
// {
//   alert(`Степень ${n} не поддерживается, введите целую степень, большую 0`); // не обязательно писать этот код на отдельной от {} строке
// }
// else // не обязательно выносить else на отдельную строку
// {
//   alert(pow(x,n)) // нет пробелов
// }
